HirokiIshiguro/rx-driver-package/source/r_rsci_iic_rx/r_rsci_iic_rx_vx.xx/r_rsci_iic_rx/src/targets/rx671/r_rsci_iic_rx671.c
/***********************************************************************************************************************
* Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_rsci_iic_rx671.c
 * Description  : Functions for using RSCI_IIC on RX devices. 
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 30.10.2025 1.00     First Release
 **********************************************************************************************************************/
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Access to peripherals and board defines. */
#include "platform.h"

#ifdef BSP_MCU_RX671
/* Defines for RSCI_IIC support */
    #include "r_rsci_iic_rx_pin_config.h"
    #include "r_rsci_iic_rx_private.h"
    #include "r_rsci_iic_rx671_private.h"
    #include "r_rsci_iic_rx_if.h"
    #include "r_rsci_iic_rx_config.h"

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   Defines specific information for each RSCI IIC channel.                   */
/*----------------------------------------------------------------------------*/
    #if RSCI_IIC_CFG_CH10_INCLUDED
/* rom info */
const rsci_iic_ch_rom_t g_rsci_iic_ch10_rom =
{
    BSP_LOCK_RSCI10,
    (rsci_regs_t)&RSCI10, /* Cast to rsci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRD.LONG, BIT3_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_RSCI10_TXI].BYTE,
    &ICU.IR[IR_RSCI10_TXI].BYTE,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GRPAL0.LONG, BIT24_MASK,
    &ICU.IER[IER_RSCI10_TXI].BYTE, BIT1_MASK,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GENAL0.LONG, BIT24_MASK,
    BSP_INT_SRC_AL0_RSCI10_TEI,
    rsci_iic_int_rsci_iic10_tei_isr,
    RSCI_IIC_CFG_CH10_INT_PRIORITY,
    RSCI_IIC_CH10_SSCL_GP,
    RSCI_IIC_CH10_SSCL_PIN,
    RSCI_IIC_MPC_SSCL010_ENABLE,
    RSCI_IIC_CH10_SSDA_GP,
    RSCI_IIC_CH10_SSDA_PIN,
    RSCI_IIC_MPC_SSDA010_ENABLE,
    RSCI_IIC_CFG_CH10_SSDA_DELAY_SELECT,
    RSCI_IIC_CFG_CH10_BITRATE_BPS,
    RSCI_IIC_CFG_CH10_DIGITAL_FILTER,
    RSCI_IIC_CFG_CH10_FILTER_CLOCK
};

/* channel control block */
rsci_iic_ch_ctrl_t g_rsci_iic_ch10_ctrl =
{
    &g_rsci_iic_ch10_rom,
    RSCI_IIC_EV_INIT,
    RSCI_IIC_MODE_NONE,
    RSCI_IIC_STS_NO_INIT,
    RSCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (rsci_iic_info_t *)NULL
};
    #endif /* RSCI_IIC_CFG_CH10_INCLUDED */

    #if RSCI_IIC_CFG_CH11_INCLUDED
/* rom info */
const rsci_iic_ch_rom_t g_rsci_iic_ch11_rom =
{
    BSP_LOCK_RSCI11,
    (rsci_regs_t)&RSCI11, /* Cast to rsci_regs_t */
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRD.LONG, BIT2_MASK, /* Cast to R_BSP_EVENACCESS_SFR */
    &ICU.IPR[IPR_RSCI11_TXI].BYTE,
    &ICU.IR[IR_RSCI11_TXI].BYTE,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GRPAL0.LONG, BIT27_MASK,
    &ICU.IER[IER_RSCI11_TXI].BYTE, BIT3_MASK,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GENAL0.LONG, BIT27_MASK,
    BSP_INT_SRC_AL0_RSCI11_TEI,
    rsci_iic_int_rsci_iic11_tei_isr,
    RSCI_IIC_CFG_CH11_INT_PRIORITY,
    RSCI_IIC_CH11_SSCL_GP,
    RSCI_IIC_CH11_SSCL_PIN,
    RSCI_IIC_MPC_SSCL011_ENABLE,
    RSCI_IIC_CH11_SSDA_GP,
    RSCI_IIC_CH11_SSDA_PIN,
    RSCI_IIC_MPC_SSDA011_ENABLE,
    RSCI_IIC_CFG_CH11_SSDA_DELAY_SELECT,
    RSCI_IIC_CFG_CH11_BITRATE_BPS,
    RSCI_IIC_CFG_CH11_DIGITAL_FILTER,
    RSCI_IIC_CFG_CH11_FILTER_CLOCK
};

/* channel control block */
rsci_iic_ch_ctrl_t g_rsci_iic_ch11_ctrl =
{
    &g_rsci_iic_ch11_rom,
    RSCI_IIC_EV_INIT,
    RSCI_IIC_MODE_NONE,
    RSCI_IIC_STS_NO_INIT,
    RSCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO, /* Cast to uint8_t */
    (rsci_iic_info_t *)NULL
};
    #endif /* RSCI_IIC_CFG_CH11_INCLUDED */

/*----------------------------------------------------------------------------*/
/*   Array for start addresses of information for each RSCI IIC channel        */
/*----------------------------------------------------------------------------*/
const rsci_iic_hdl_t g_rsci_iic_handles[RSCI_IIC_NUM_CH_MAX] =
{
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    NULL,
    #if RSCI_IIC_CFG_CH10_INCLUDED
    &g_rsci_iic_ch10_ctrl,
    #else
    NULL,
    #endif
    #if RSCI_IIC_CFG_CH11_INCLUDED
    &g_rsci_iic_ch11_ctrl,
    #else
    NULL,
    #endif
    NULL
};

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static rsci_iic_return_t rsci_iic_set_frequency (rsci_iic_info_t * p_rsci_iic_info);
static void rsci_iic_clear_ir_flag (rsci_iic_info_t * p_rsci_iic_info);

/***********************************************************************************************************************
 * Function Name: r_rsci_iic_check_arguments
 * Description  : check to parameter.
 * Arguments    : rsci_iic_info_t * p_rsci_iic_info   ; IIC Information
 *              ; rsci_iic_api_mode_t called_api      ; Internal Mode
 * Return Value : RSCI_IIC_SUCCESS                    ; Successful operation
 *              ; RSCI_IIC_ERR_INVALID_CHAN           ; channel number invalid for part
 *              : RSCI_IIC_ERR_INVALID_ARG            ; Parameter error
 **********************************************************************************************************************/
rsci_iic_return_t r_rsci_iic_check_arguments(rsci_iic_info_t * p_rsci_iic_info, rsci_iic_api_mode_t called_api)
{

    if (NULL == p_rsci_iic_info)
    {
        return RSCI_IIC_ERR_INVALID_ARG;
    }

    if (RSCI_IIC_MODE_RECEIVE == called_api)
    {

        if (((NULL == p_rsci_iic_info->p_slv_adr) || (NULL == p_rsci_iic_info->p_data2nd))
                || ((uint32_t)NULL == p_rsci_iic_info->cnt2nd))
        {
            return RSCI_IIC_ERR_INVALID_ARG;
        }

